In [1]:
import pandas as pd

In [29]:
items = {'Bob': pd.Series([245, 25, 55], index = ['bike', 'pants', 'watch']), 
         'Alice': pd.Series([40, 110, 500, 45], index=['book', 'glasses','bike', 'pants'])}
type(items)

dict

In [ ]:
Dataframe is like speadsheets in excel.

In [3]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

**Nan** need to be removed before data analycis.

If we don't feed panda the index label, pandas will create numerical index automaticly.

In [5]:
data = {'Bob':pd.Series([245, 25, 55]), 
        'Alice': pd.Series([40, 110, 500, 45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

**Attributes**

In [6]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [9]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [10]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [11]:
shopping_carts.shape

(5, 2)

In [12]:
shopping_carts.ndim

2

In [13]:
shopping_carts.size
#2 columns and 5 raws are 10 items

10

#### Subset of data

In [30]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [16]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [17]:
alice_sel_shopping_cart = pd.DataFrame(items, index=['glasses', 'bike'], columns=['Alic'])
alice_sel_shopping_cart

        Alic
glasses  NaN
bike     NaN

In [19]:
data = {'Integer':[1, 2, 3], 'Float':[3.4, 23.4, 654.2]}
#We can manually put index label here.
df = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3'])
df

         Integer  Float
label 1        1    3.4
label 2        2   23.4
label 3        3  654.2

In [31]:
#Pandas can also use a list of dictionary to create Dataframe
items = [{'bikes': 20, 'pants':30, 'watches':35},
        {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

store_items= pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

#### Accessing Elements in Pandas DataFrames

In [23]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [32]:
store_items[['bikes','pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [33]:
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

When we want to access paticular value column lable always come first.

In [34]:
store_items['bikes']['store 2']

15

#### Add columns

In [35]:
store_items['shirts'] = [14, 2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      14
store 2     15     50.0      5       10       2

In [36]:
#Adding to column to make a new column.
store_items['suits']  = store_items['shirts'] + store_items['pants']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      14     44
store 2     15     50.0      5       10       2      7

####  Add raw
Need to create a new dataframe and appended to old dataframe.

In [46]:
new_items = [{'bikes': 20, 'pants':30, 'watches': 35, 'glasses': 4}]

new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [62]:
store_items = store_items.append(new_store)
store_items

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    14.0   44.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [63]:
#Using part of old column to create new column.
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new_watches
store 1     20      NaN     30    14.0   44.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

#### Insert data
The first argumens is column index, the second is the name of new column, the third is data.

In [64]:
store_items.insert(5, 'shoes', [8, 3, 2])
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      NaN     30    14.0   44.0      8       35          NaN
store 2     15     50.0      5     2.0    7.0      3       10         10.0
store 3     20      4.0     30     NaN    NaN      2       35         35.0

#### Delete
`pop()` method can only delete column.
`drop()`method can delete colume and raws by using `axis` keyword.

In [65]:
store_items.pop('new_watches')
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches
store 1     20      NaN     30    14.0   44.0      8       35
store 2     15     50.0      5     2.0    7.0      3       10
store 3     20      4.0     30     NaN    NaN      2       35

In [66]:
store_items = store_items.drop(['watches','shoes'], axis=1)
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    14.0   44.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [67]:
store_items = store_items.drop(['store 1', 'store 2'], axis = 0)
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

#### Rename

In [68]:
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

         hats  glasses  pants  shirts  suits
store 3    20      4.0     30     NaN    NaN

In [69]:
store_items = store_items.rename(index = {'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [70]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

###  Dealing with NaN

In [87]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

store_items2 = pd.DataFrame(items2, index=['store 1', 'store 2', 'store 3'])
store_items2

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [75]:
x = store_items2.isnull()
print(x)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [76]:
x = store_items2.isnull().sum()
print(x)

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [78]:
x = store_items2.isnull().sum().sum()
print(x)

3

In [80]:
store_items2.count()

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

#### Remove NaN value

In [81]:
store_items2.dropna(axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [85]:
store_items2.dropna(axis=1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

####  Replace NaN value

`fillna()` is operate out of place.

In [88]:
store_items2.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [89]:
#fill in the data with value in previous column
store_items2.fillna(method = 'ffill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [91]:
#fill in the value with value in prvious raw
store_items2.fillna(method='ffill', axis =1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [94]:
#fill in value backward as opposite to ffill
store_items2.fillna(method = 'backfill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [96]:
store_items2.interpolate(method='linear', axis=0)
#interpolate is operate out of place.

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [97]:
store_items2.interpolate(method='linear', axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

In [102]:
print(store_items2)
store_items2.mean(axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

store 1    25.500000
store 2    13.428571
store 3    19.800000
dtype: float64

In [103]:
# fill NaN with average of each column.
store_items2.fillna(store_items2.mean(), axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     27.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     8.5     10   26.0       35

### Load Data into a Pandas Dataframe

#### Load CSV

In [104]:
google_stock = pd.read_csv('./goog-1.csv')
print(type(google_stock))
print(google_stock.shape)

<class 'pandas.core.frame.DataFrame'>
(3313, 7)

In [106]:
#By default check first 5 raws.
google_stock.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [108]:
#Check first two raws by specify the number.
google_stock.head(2)

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800

In [109]:
#check the last 5 raws by default.
google_stock.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [110]:
#Check the last two raws by default.
google_stock.tail(2)

,Date,Open,High,Low,Close,Adj Close,Volume
3311,2017-10-12,987.450012,994.119995,985.0,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.0,989.679993,989.679993,1157700

In [112]:
#check if there are any NaN value.
google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [113]:
#Show statistic values if it can be described.
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [114]:
#Show one column statistic value
google_stock['Adj Close'].describe()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

In [115]:
#Show one statistic value
google_stock.max()

Date         2017-10-13
Open                992
High             997.21
Low                 989
Close            989.68
Adj Close        989.68
Volume         82768100
dtype: object

In [116]:
google_stock.mean()

Open         3.801861e+02
High         3.834937e+02
Low          3.765193e+02
Close        3.800725e+02
Adj Close    3.800725e+02
Volume       8.038476e+06
dtype: float64

In [117]:
google_stock['Close'].min()

49.681866

In [118]:
#Data Correlation.
google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

#### Group Data

In [ ]:
data = pd.read_csv('./fake_company.csv')
data.groupby(['Year'])['Salary'].sum()
data.groupby(['Year'])['Salary'].mean()
data.groupby(['Name'])['Salary'].sum()
data.groupby(['Year', 'Department'])['Salary'].sum()

----
```
google_stock = pd.read_csv('./GOOG.csv',
                  usecols = ['Date', 'Adj Close'],
                  parse_dates = True, 
                  index_col=['Date'])
```
`index_col` is keyword to indicate which column use as an index.
`usecols` is keyword to tell pandas which columns will be imported.
`parse_dates` is keyword to let pandas convert string to real dates from of year/month/day

In [ ]:
#Create Calendar dates
dates = pd.date_range('2000-01-01', '2016-12-31')

#Create empty DataFrame use above dates as indices.
all_stocks = pd.DataFrame(index = dates)

#### Rename A Column

In [ ]:
google_stock = google_stock.rename( columns={'Adj Close':'Google'})